{% extends "base.html" %}


{% block scripts %}
{{super()}}

<script type="text/javascript">
 lexemeSparql = `
# Data for a specific lexeme
SELECT
  ?description 
  ?value ?valueLabel 
  ?source ?sourceLabel
WHERE {
  VALUES ?lexeme { wd:{{ l }} }
  {
    BIND(1 AS ?order)
    BIND("Lemma" AS ?description)
    ?lexeme wikibase:lemma ?value .
  }
  UNION 
  {
    BIND(2 AS ?order)
    BIND("Language" AS ?description)
    ?lexeme dct:language ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
  }
  UNION 
  {
    BIND(3 AS ?order)
    BIND("Lexical category" AS ?description)
    ?lexeme wikibase:lexicalCategory ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
  }
  UNION 
  {
    BIND(4 AS ?order)
    BIND("Instance of" AS ?description)
    ?lexeme wdt:P31 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
  }
  UNION 
  {
    BIND(6 AS ?order)
    BIND("Word stem" AS ?description)
    OPTIONAL {
      ?lexeme wdt:P5187 ?value .
    }
  }
  UNION 
  {
    BIND(10 AS ?order)
    BIND("Grammatical gender" AS ?description)
    ?lexeme wdt:P5185 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
  }
  UNION 
  {
    BIND(11 AS ?order)
    BIND("Conjugation class" AS ?description)
    ?lexeme wdt:P5186 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = "en")
  }
  UNION 
  {
    # Derived from
    BIND(12 AS ?order)
    BIND("Derived from" AS ?description)
    OPTIONAL {
     ?lexeme wdt:P5191 ?value .
     ?value wikibase:lemma ?valueLabel .	  
    }
  }
  UNION 
  {
    # Homographs
    BIND(14 AS ?order)
    BIND("Homographs" AS ?description)
    wd:{{ l }} wdt:P5402 ?value .
    ?value wikibase:lemma ?valueLabel .
  }
  UNION 
  {
    BIND(15 AS ?order)
    BIND("Compound" AS ?description)
    wd:{{ l }} wdt:P5238+ ?value .
    ?value wikibase:lemma ?valueLabel .
  }
  UNION 
  {
    BIND(20 AS ?order)
    BIND("Described in" AS ?description)
    ?lexeme wdt:P1343 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
  }
  UNION 
  {
    BIND(30 AS ?order)
    BIND("Usage example" AS ?description)
    ?lexeme p:P5831 ?value_statement .
    ?value_statement ps:P5831 ?value .
    OPTIONAL {
      ?value_statement prov:wasDerivedFrom / pr:P248 ?source . 
      ?source wdt:P1476 ?sourceLabel .
    }   
  }
}
ORDER BY ?order
`


 formsSparql = `
 # List of forms for a specific lexeme
 SELECT
  ?form ?formLabel
   (GROUP_CONCAT(DISTINCT ?featureLabel; separator=" // ") AS ?features)
   # (GROUP_CONCAT(DISTINCT ?hyphenation; separator=" // ") AS ?hyphenations)
 WHERE {
   wd:{{ l }} ontolex:lexicalForm ?form .
   ?form ontolex:representation ?formLabel .
   OPTIONAL {
     ?form wikibase:grammaticalFeature ?feature .
     ?feature rdfs:label ?featureLabel .
     FILTER (LANG(?featureLabel) = "en")
   }
   OPTIONAL {
    ?form wdt:P5279 ?hyphenation
   }
 }
 GROUP BY ?form ?formLabel
 ORDER BY (STR(?form))
 `

 sensesSparql = `
# List of senses for a specific lexeme
 SELECT
  ?sense ?senseLabel
  (GROUP_CONCAT(?gloss; separator=" // ") AS ?glosses)
  (IRI(CONCAT("https://commons.wikimedia.org/w/index.php?title=Special:Redirect/file&width=200&wpvalue=", 
          SUBSTR(STR(SAMPLE(?images)), 52))) AS ?sense_image)
 WHERE {
   wd:{{ l }} ontolex:sense ?sense .
   BIND(SUBSTR(STR(?sense), 32) AS ?senseLabel)
   ?sense skos:definition ?gloss .
   OPTIONAL {
     ?sense wdt:P18 ?images
   }
 }
 GROUP BY ?sense ?senseLabel
 ORDER BY (STR(?sense))
`


 compoundsSparql = `
SELECT
  ?lexeme ?lexemeLabel
  ?lexical_category ?lexical_categoryLabel
  ?other_compounds
WHERE {
  {
    SELECT
      ?lexeme
      (GROUP_CONCAT(?compoundLabel; separator=" // ") AS ?other_compounds)
    WHERE {
      ?lexeme wdt:P5238+ wd:{{ l }} .
      OPTIONAL {
        ?lexeme wdt:P5238 ?compound .
        ?compound wikibase:lemma ?compoundLabel .
        FILTER (?compound != wd:{{ l }})
      }
    }
    GROUP BY ?lexeme
  }    
  ?lexeme wikibase:lemma ?lexemeLabel .
  OPTIONAL {
    ?lexeme wikibase:lexicalCategory ?lexical_category .
    ?lexical_category rdfs:label ?lexical_categoryLabel .
    FILTER (LANG(?lexical_categoryLabel) = 'en')
  }
}
`


 $(document).ready(function() {
     sparqlToDataTable(lexemeSparql, "#lexeme",
		       options={
			   linkPrefixes: {
			       source: 'reference/'
			   },
			    paging: false,
			    sDom: 'rt',
			});
      sparqlToDataTable(formsSparql, "#forms",
			options={paging: false, sDom: 'rt',});
      sparqlToDataTable(sensesSparql, "#senses",
			options={paging: false, sDom: 'rt',});
      sparqlToDataTable(compoundsSparql, "#compounds",
			options={paging: false, sDom: 'rt',});
  });

 </script>

 {% endblock %}


 {% block page_content %}

 <div class="l-entry">

     <h1>Lexeme: {{ l }}</h1>
     
     
     <p>
	 <a title="View and edit lexeme in Wikidata"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="https://www.wikidata.org/wiki/Lexeme:{{ l }}">Wikidata</a>
     </p>
     
     <table class="table table-hover" id="lexeme"></table>
     
     <div class="container">
	 <div class="row">
	      <div class="col-12 col-lg-6">
		  <table class="table table-hover" id="forms"></table>
	      </div>
	      <div class="col-12 col-lg-6">
		  <table class="table table-hover" id="senses"></table>
	      </div>
	 </div>
     </div>

    <hr/>
    
    <h2>Compounds</h2>

    <table class="table table-hover" id="compounds"></table>

    <div class="embed-responsive embed-responsive-4by3">
      <iframe loading="lazy" class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%23%20Show%20compound%20hierarchy%0A%23defaultView%3AGraph%0ASELECT%20%3Flexeme1%20%3Flexeme1Label%20%3Flexeme2%20%3Flexeme2Label%20%7B%0A%20%20hint%3AQuery%20hint%3Aoptimizer%20%22None%22.%0A%20%20VALUES%20%3Flexeme%20%7B%20wd%3A{{ l }}%20%7D%0A%20%20%7B%0A%20%20%20%20%3Flexeme%20wdt%3AP5238%2B%20%7C%20%5Ewdt%3AP5238%2B%20%3Flexeme1%20%2C%20%3Flexeme2%20.%20%0A%20%20%20%20%3Flexeme1%20wdt%3AP5238%20%3Flexeme2%20.%0A%20%20%7D%0A%20%20UNION%0A%20%20%7B%0A%20%20%20%20BIND%28%3Flexeme%20AS%20%3Flexeme1%29%0A%20%20%20%20%3Flexeme%20wdt%3AP5238%20%3Flexeme2%20.%0A%20%20%7D%0A%20%20UNION%0A%20%20%7B%0A%20%20%20%20BIND%28%3Flexeme%20AS%20%3Flexeme2%29%0A%20%20%20%20%3Flexeme1%20wdt%3AP5238%20%3Flexeme%20.%0A%20%20%7D%0A%20%20%3Flexeme1%20wikibase%3Alemma%20%3Flexeme1Label%20.%0A%20%20%3Flexeme2%20wikibase%3Alemma%20%3Flexeme2Label%20.%0A%7D%0ALIMIT%20500"></iframe>
  </div>


    
</div>

{% endblock %}


